app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2020-08-19 03:20:54.753746"], ["id", 1]]
---
  def update
    article = Article.find(params[:id])
    article.title = params[:article][:title]
    article.description = params[:article][:description]
    article.save